Readme file updated
